{"posts":[{"title":"Bienvenue","text":"Hello, everyone. My name is Wai Yip (Wei Ye), This is my personal website.Coucou les amis ! Je m’appelle Wai Yip. C’est mon site personnel. Currently, I major in English in my undergraduate program, while I also did some exploration in education sociology. If everything goes smoothly, I will study Anthropology in graduate school, as I have always aspired to explore sociology and anthropology since I was in secondary school. By the way, I am also a visual novel lover. Wellcome to share anything related with me :Ds","link":"/2025/10/01/Bienvenue/"},{"title":"works","text":"NON-FictionsI learned writing non-fictions when I was a sophomore. I love expressing myself in great creations of non-fictions.","link":"/2026/01/17/works/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2025/10/01/hello-world/"},{"title":"hobby","text":"Visual Novel 洞石火 DISCO 开局一秀女 古代渣女模拟器 火山的女儿 Movies and Series","link":"/2026/01/17/hobby/"}],"tags":[],"categories":[],"pages":[{"title":"CV","text":"Here is the PDF of my CV. Ye Wei📧 ArianMalys@protonmail.com📞 +86 134 1635 7411 EducationGuangdong University of Foreign Studies (GDUFS)School of English and EducationBachelor of Arts in English (Education) | Sept 2022 – Jun 2026 (Expected)• GPA: 3.77/4.00• Coursework: Gender Studies, Pedagogics, TEFL, Educational Psychology, Linguistics, Sociology of Education• Distinction: A+ in Introduction to Gender Studies Through Cinema (Innovative Talents Program, 2024) Research Experience• First Author (Pending Publication): Paper under review in International Journal of Inclusive Education (SSCI Q2).• Research Training: Experienced in qualitative social science research methods (interviews, discourse analysis, case studies). Academic-Related Activities• Oral History Research (COVID-19, Guangzhou, 2020): Conducted and documented interviews for social research purposes.• Gender Education Engagement: Participated in online academic discussions on gender education; recognized for outstanding contributions.• Letter-Writing Mentorship (“Blue Letter” Program): One-year literacy and education support for rural children. Visual ProjectsAll videos were independently completed—from research, shooting, interviewing, and clipping, to script writing, dubbing, and media management. • “Telling China’s Story” (Cultural Communication Project): Produced bilingual video introducing brick carving culture in Shawan Ancient Town.• Cultural Tourism Promotion (Museum of the Southern Han Dynasty): Developed English-language video and media content.• Visual Memoir: A personal media project reflecting on my adolescence.• Cultural Analysis: Discussed a female character and its prototype in an independent strategy role-playing game.• English Dubbing: Provided English narration and video editing for culinary materials. Languages• English: Advanced (TOEFL 104; TEM-4 Excellent; Winner, GDUFS English Phonetics Contest (2024))• Chinese: Native in Mandarin and Cantonese, understand Hakka• French: Intermediate (A2+)","link":"/cv/index.html"}]}